Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/unemployment_and_redundancy/employment_support_schemes/jobsplus.html.txt.tmx
Source language: en
Languages: ga

source: JobsPlus is a employer incentive which encourages and rewards employers who employ jobseekers on the Live Register
ga: Dreasacht fostóra is ea JobsPlus a spreagann fostóirí cuardaitheoirí poist a fhostú atá ar an mBeochlár agus bronnann an dreasacht luaíocht orthu as amhlaidh a dhéanamh

source: This incentive replaces the Revenue Job Assist and Employer Job (PRSI) Exemption Scheme from 1 July 2013
ga: Tháinig an dreasacht seo in ionad na Scéime Postchúnamh Ioncaim agus na Scéime Díolúine Post Fostóra (ÁSPC) ón 1 Iúil 2013

source: It is designed to encourage employers and businesses to employ people who have been out of work for long periods
ga: Tá an dreasacht in ainm is fostóirí agus gnólachtaí a spreagadh chun daoine a fhostú nach raibh ag oibriú ar feadh tréimhsí fada

source: Eligible employers who recruit full-time employees on or after 1 July 2013 may apply for the incentive
ga: Féadfaidh fostóirí incháilithe a dhéanann fostaithe lánaimseartha a earcú an 1 Iúil 2013, nó ina dhiaidh sin, iarratas a dhéanamh ar an dreasacht

source: The Department of Social Protection pays the incentive to the employer monthly in arrears over a 2-year period. It provides 2 levels of regular cash payments:
ga: Íocann an Roinn Coimirce Sóisialaí an dreasacht seo leis an bhfostóir gach mí i riaráistí, thar thréimhse 2 bhliain. Cuireann an RCS dhá leibhéal d’íocaíochtaí rialta airgid ar fáil:

source: • A payment of €7,500 for each person recruited who has been unemployed for more than 12 but less than 24 months - see 'JobsPlus for young people' below
ga: • Íocaíocht €7,500 le haghaidh gach duine a earcaítear a bhí dífhostaithe ar feadh breis agus 12 mhí ach níos lú ná 24 mí - féach 'JobsPlus do dhaoine óga'

source: • A payment of €10,000 for each person recruited who has been unemployed for more than 24 months
ga: • Íocaíocht €10,000 le haghaidh gach duine a earcaíodh a bhí dífhostaithe ar feadh breis agus 24 mí

source: Since 1 January 2015, under the JobsPlus Youth part of the scheme, the qualifying period for JobsPlus for jobseekers aged under 25 has been reduced to 4 months
ga: Ó 1 Eanáir 2015, faoin cuid JobsPlus Youth den scéim, laghaidh an tréimhse cháilíochta JobsPlus go dtí 4 seachtain le haghaidh cuardaitheoirí poist faoi bhun aois 25

source: It remains at 12 months for other jobseekers
ga: Bíonn sé 12 mhí do chuardaitheoirí eile

source: Eligible young people will be given certification that they qualify for the JobsPlus subsidy and they can use this when applying for jobs
ga: Tabharfar deimhniú cáilíochta le haghaidh fóirdheontais Jobsplus do dhaoine óga incháilithe agus is féidir é a úsáid nuair déanfaidh siad iarratas ar phoist

source: JobsPlus is available to all employers in the private (including commercial semi-state), community, not-for-profit and voluntary sectors
ga: Tá fáil ar JobsPlus ag gach fostóir sna hearnálacha príobháideacha pobail (lena n-áirítear an earnáil tráchtála leathstáit) agus sna hearnálacha neamhbhrabúsacha agus deonacha

source: It is not open to public service employers
ga: Níl an scéim oscailte d’fhostóirí seirbhíse poiblí

source: Employers can avail of Jobsplus when filling positions that arise as a consequence of natural turnover
ga: Féadfaidh fostóirí leas a bhaint as JobsPlus nuair a bhíonn poist á líonadh acu a eascraíonn mar thoradh ar aistriú nádúrtha seilbhe

source: Employers must meet the following conditions:
ga: Ní mór d’fhostóirí na coinníollacha a leanas a chomhlíonadh:

source: • The business must be registered as a PAYE employer with Revenue
ga: • Ní mór an gnólacht a chlárú mar fhostóir ÍMAT leis na Coimisinéirí Ioncaim

source: • The employer must be compliant with Irish tax and employment laws
ga: • Ní mór don fhostóir dlíthe cánach agus fostaíochta na hÉireann a chomhlíonadh

source: Employers will be asked to give an officer of the Department of Social Protection permission to check your status with Revenue and to obtain a Tax Clearance Certificate using Revenue’s on line service
ga: Iarrfar ar fhostóirí cead a thabhairt d’oifigeach na Roinne Coimirce Sóisialaí chun do stádas a sheiceáil leis na Coimisinéirí Ioncaim agus chun Deimhniú Imréitigh Cánach a fháil trí leas a bhaint as seirbhís ar líne na gCoimisinéirí Ioncaim

source: • The employer must offer full-time employment of over 30 hours per week, spanning at least 4 days per week
ga: • Ní mór don fhostóir fostaíocht lánaimseartha breis agus 30 uair an chloig sa tseachtain a thairiscint, a mhaireann ar feadh 4 lá sa tseachtain ar a laghad

source: The eligible employee must be on payroll and subject to PAYE and PRSI
ga: Ní mór don fhostaí incháilithe bheith ar an bpárolla agus faoi réir ÍMAT agus ÁSPC

source: • Employers must give details of workforce prior to application, where an increase in the work force is not evident employers will be asked to provide additional information to the Department to support the application
ga: • Ní mór d’fhostóirí sonraí a thabhairt ar a lucht saothair sula ndéantar iarratas, sa chás nach bhfuil méadú ar an lucht saothair le tabhairt faoi deara, iarrfar ar fhostóirí bhreis faisnéise a sholáthar don Roinn chun tacú leis an iarratas

source: You can find more information for employers in this list of frequently asked questions for JobsPlus employers
ga: Féadfaidh tú teacht ar thuilleadh faisnéise le haghaidh fostóirí sa liosta seo de cheisteanna coitianta le haghaidh fhostóirí JobsPlus

source: • Be getting Jobseeker’s Benefit (JB), Jobseeker’s Allowance (JA), Jobseeker's Transitional payment (JST) or signing on for credits
ga: • Sochar Cuardaitheora Poist (SCP), Liúntas Cuardaitheora Poist (LCP), íocaíocht Idirthréimhseach Cuardaitheora Poist (ICP) a bheith á fháil acu, nó bheith ag síniú le haghaidh creidmheasanna

source: • Be at least 12 months* (312 days) on the Live Register in the previous 18 months to qualify as an eligible employee for the €7,500 incentive
ga: • Bheith ar an mBeochlár ar feadh ar a laghad 12 mhí* (312 lá) le 18 mí anuas chun cáiliú mar fhostaí incháilithe le haghaidh na dreasachta €7,500

source: The qualifying period is 4 months (104 days) for young people aged under 25
ga: Is 4 mhí (104 lá) é an tréimhse cháilíochta do dhaoine óga faoi bhun aois 25

source: There is no qualifying period for people getting Jobseeker's Transitional payment
ga: Níl aon tréimhse cháilíochta do dhaoine ag fáil Íocaíocht Idirthréimhseach Cuardaitheora Poist

source: • Be at least 24 months* (624 days) on the Live Register in the previous 30 months to qualify as an eligible employee for the higher incentive of €10,000
ga: • Bheith ar an mBeochlár ar feadh ar a laghad 24 mhí* (624 lá) le 30 mí anuas chun cáiliú mar fhostaí incháilithe le haghaidh na dreasachta níos airde €10,000

source: *Periods spent on certain activation schemes, or time spent in prison may count this time towards the qualifying period once entitlement to one of the qualifying payments outlined above is re-established prior to commencing employment
ga: *D’fhéadfaí tréimhsí a caitheadh ar roinnt scéimeanna gníomhachtaithe, nó am a caitheadh i bpríosún a chur san áireamh i dtreo na tréimhse cáilíochta a luaithe a athdheimhnítear teidlíocht i leith ceann de na híocaíochtaí cáilíochta ar a dtugtar breac-chuntas thuas sula dtosaítear leis an bhfostaíocht

source: Jobseekers’ payments paid in conjunction with periods of casual employment may count towards satisfying the qualifying period, as will breaks in jobseekers payments as a result of periods of illness during which Illness Benefit is paid
ga: D’fhéadfaí íocaíochtaí cuardaitheora poist a íoctar i dtaca le tréimhsí fostaíochta ócáidí a chur san áireamh leis an tréimhse cháilíochta a shásamh, mar aon le sosanna ar íocaíochtaí cuardaitheora poist mar thoradh ar thréimhsí breoiteachta a n-íoctar Sochar Breoiteachta lena linn

source: People taking part in internships under JobBridge and the Work Placement Programme (WPP) who were getting a qualifying payment prior to their internship may be employed directly from these schemes once the required qualifying period and conditions are satisfied
ga: D’fhéadfaí daoine a ghlacann páirt in intéirneachtaí faoi JobBridge agus sa Chlár Socrúchán Oibre, a raibh íocaíocht incháilithe á fáil acu roimh a n-intéirneacht, a fhostú go díreach ó na scéimeanna seo a luaithe a shásaítear an tréimhse agus na coinníollacha cáilíochta

source: Family Income Supplement: New employees under the JobsPlus scheme may be entitled to get Family Income Supplement
ga: Forlíonadh Ioncam Teaghlaigh: D’fhéadfadh fostaithe nua faoi scéim JobsPlus bheith i dteideal Forlíonadh Ioncam Teaghlaigh a fháil

source: Medical card: People who have been unemployed for at least 12 months may keep their medical card for 3 years when they take up new employment
ga: Cárta Leighis: Féadfaidh daoine a bhí dífhostaithe ar feadh 12 mhí ar a laghad a gcárta leighis a choimeád ar feadh 3 bliana nuair a ghlacann siad le fostaíocht nua

source: Rent and Mortgage Interest Supplement: Rent and Mortgage Interest Supplement are not payable where a jobseeker or spouse are in full-time employment (30 hours or more a week)
ga: Forlíonadh Cíosa agus Forlíonadh Ús Morgáiste: Níl Forlíonadh Cíosa agus Forlíonadh Ús Morgáiste iníoctha nuair atá cuardaitheoir poist nó céile fostaithe go lánaimseartha (30 uair an chloig nó níos mó sa tseachtain)

source: People who are already getting Rent Supplement may be able to keep it, subject to a means test, while they are working full time, as long as they are eligible for housing support under the Rental Accommodation Scheme (RAS)
ga: D’fhéadfadh go mbeadh daoine a bhfuil Forlíonadh Cíosa á fháil acu é a choimeád, faoi réir tástáil mhaoine, fad atá siad ag oibriú go lánaimseartha, a fhad agus atá siad i dteideal tacaíocht tithíochta a fháil faoin Scéim Cóiríochta Cíosa (RAS)

source: People already getting Mortgage Interest Supplement may be able to keep it while working full time as long as the gross household income does not exceed €317.43 a week
ga: D’fhéadfadh go mbeadh daoine a bhfuil Forlíonadh Ús Morgáiste á fháil acu é a choimeád fad atá siad ag oibriú go lánaimseartha, a fhad agus nach sáraíonn an glanioncam teaghlaigh €317.43 sa tseachtain

source: You can read more information for jobseekers in this list of frequently asked questions for Jobsplus employees
ga: Féadfaidh tú tuilleadh faisnéise a léamh le haghaidh cuardaitheoirí poist sa liosta seo de cheisteanna coitianta le haghaidh fhostaithe JobsPlus

source: If approved, the employer will receive the following payments over a 2-year period for each eligible person they recruit and retain in employment:
ga: Má dhéantar thú a fhaomhadh, gheobhaidh an fostóir na híocaíochtaí a leanas thar thréimhse dhá bhliain le haghaidh gach duine incháilithe a earcaíonn siad agus a choimeádann siad i bhfostaíocht:

source: │Eligible person │Amount │
ga: │Duine incháilithe │Méid │

source: │Has been unemployed for between 12 and 24 months (4 months if aged under 25) │€7,500 │
ga: │Duine a bhí dífhostaithe ar feadh idir 12 agus 24 mí (4 mhí le haghaidh duine faoi bhun aois 25) │€7,500 │

source: │Has been unemployed for 24 months or more │€10,000 │
ga: │Duine a bhí dífhostaithe ar feadh 24 mí nó níos faide

source: Payment will be made monthly in arrears by Electronic Fund Transfer (EFT) over a 24-month period
ga: Déanfar an íocaíocht gach mí i riaráistí trí Ríomhaistriú Leictreonach (EFT) thar thréimhse 24 mí

source: It will not be taxable for income or corporation tax purposes
ga: Ní ghearrfar cáin ar an íocaíocht ar mhaithe le cuspóirí ioncaim nó cáin chorparáide

source: If an employer decides to recruit an additional employee, they can log on to jobsplus.ie and complete an online application form giving, for example, the name of company, size of workforce, bank details and economic sector of company
ga: Má dhéanann fostóir an cinneadh chun fostaí eile a earcú, féadfaidh siad logáil ar jobsplus.ie agus foirm iarratais ar líne a chomhlíonadh, agus ainm na cuideachta, méid an lucht saothair, sonraí bainc agus earnáil gheilleagrach na cuideachta a sholáthar

source: Once this is submitted an officer of the Department of Social Protection (DSP) will review and check the tax clearance certificate is in order and email the employer if it is approved
ga: A luaithe a dhéantar seo a sheoladh isteach, déanfaidh oifigeach den Roinn Coimirce Sóisialaí (RCS) é seo a athbhreithniú agus seiceálfaidh siad go bhfuil an deimhniú imréitigh cánach in ord agus seolfaidh siad ríomhphost chuig an bhfostóir má dhéantar iad a fhaomhadh

source: Once eligibility is confirmed by the DSP an employer may start to recruit, either by contacting their local Intreo centre or employment services office for details of suitably experienced and qualified candidates for their vacancy
ga: A luaithe a dheimhníonn an RCS fostóir, féadfaidh siad tosú ag earcú, cibé acu trí theagmháil a dhéanamh lena nIonad áitiúil Intreo nó lena seirbhísí áitiúla fostaíochta chun sonraí a fháil ar iarrthóirí ag a bhfuil an taithí agus na cáilíochtaí cearta le haghaidh a bhfolúntais

source: They could also register the vacancy with Jobs Ireland
ga: Ina theannta sin, d’fhéadfaidís an folúntas a chlárú le Jobs Ireland

source: Once preliminary interviews have been conducted and candidates have been shortlisted employers should then ask these candidates to log on to jobsplus.ie to check their eligibility for JobsPlus
ga: A luaithe a thugtar faoi réamhagallaimh agus go gcuirtear iarrthóirí ar an ngearrliosta, ba cheart d’fhostóirí ansin iarraidh ar na hiarrthóirí seo logáil ar jobsplus.ie lena n-incháilitheacht a sheiceáil le haghaidh JobsPlus

source: The DSP will process their request and verify eligibility by posting a two-part JP1 form to the candidate
ga: Próiseálfaidh an RCS a n-iarratas agus fíoróidh siad a n-incháilitheacht trí fhoirm dhá chuid JP1 a sheoladh chuig an iarrthóir

source: Part A of the JP1 form will confirm the employee’s eligibility and rate of payment for a prospective employer, Part B is to be completed by the employer if they choose to employ the candidate
ga: Deimhneoidh Cuid A d’fhoirm JP1 incháilitheacht an fhostaí agus an ráta pá le haghaidh fostóir ionchasach. Tá Cuid B le comhlánú ag an bhfostóir má roghnaíonn siad chun an iarrthóir a fhostú

source: The candidate should bring the two-part JP1 form confirming eligibility to the employer for consideration
ga: Ba cheart don iarrthóir foirm dhá chuid JP1, ina ndeimhnítear incháilitheacht, a thabhairt don fhostóir le breithniú a dhéanamh ar an bhfoirm

source: When an employer identifies the most suitable candidate for the position, they should complete part B of the JP1 form for that candidate, sign the declaration and return to the DSP
ga: A luaithe a shainaithníonn fostóir an t-iarrthóir is oiriúnaí don phost, ba cheart dóibh Cuid B d’fhoirm JP1 a chomhlánú don iarrthóir sin, agus an dearbhú a shíniú agus é a sheoladh chuig an RCS

source: The JP1 form will be processed by the Department and once all conditions are satisfied employers will be notified by e-mail that they have been awarded the incentive with regard to the employee specified on the JP1 form
ga: Próiseálfaidh an Roinn foirm JP1 agus a luaithe a chomhlíontar gach coinníoll, cuirfear na fostóirí ar an eolas trí ríomhphost gur bronnadh orthu an dreasacht maidir leis an bhfostaí a shonraítear ar fhoirm JP1

source: Once the candidate is offered a position they should contact the DSP to close their jobseeker’s claim
ga: A luaithe a dhéantar post a thairiscint don iarrthóir, ba cheart dóibh teagmháil a dhéanamh leis an RCS lena n-éileamh cuardaitheora poist a dhúnadh

source: This can be done on line at welfare.ie or by contacting their local Intreo Centre or social welfare office
ga: Féadtar é seo a dhéanamh ar líne ag welfare.ie nó trí theagmháil a dhéanamh lena nIonad Intreo áitiúil nó lena n-oifig áitiúil leasa shóisialaigh

source: Payment of JobsPlus can only start once the DSP confirms that the new employee’s jobseeker claim has closed
ga: Ní féidir le híocaíocht JobsPlus tosú ach go dtí go ndearbhaíonn an RCS gur dúnadh éileamh cuardaitheora poist an fhostaí nua

source: If the application is refused the employer can request a review of the decision by a higher officer in the Department of Social Protection
ga: Má dhiúltaítear an t-iarratas, féadfaidh an fostóir athbhreithniú a lorg ar an gcinneadh ó oifigeach níos ceannasaí sa Roinn Coimirce Sóisialaí

source: Employers should apply to register their company at jobsplus.ie
ga: Ba cheart d’fhostóirí iarratas a dhéanamh chun a gcuideachta a chlárú ag jobsplus.ie

source: You can get further information about JobsPlus by logging on to jobsplus.ie, emailing Jobsplusinfo@welfare.ie or calling (071) 9672535/9672583
ga: Féadfaidh tú teacht ar a thuilleadh faisnéise faoi JobsPlus trí logáil ar jobsplus.ie, ríomhphost a sheoladh chuig Jobsplusinfo@welfare.ie nó trí ghlao ar (071) 9672535/9672583

source: Information is also available from your local social welfare office or Intreo centre
ga: Ina theannta sin, tá fáil ar fhaisnéis ó d’oifig áitiúil leasa shóisialaigh nó d'ionad Intreo
